       01  Program-Control.
           
           03  Dispatch-Flag          PIC 9(2) COMP-5. 
               88 Cancel-On-Return    VALUE 1 FALSE 0.
           
           03  Exit-Flag              PIC 9(2) COMP-5.
               88 Exit-On-Return      VALUE 1 FALSE 0.

           03  Program-Name           PIC X(8).
