       class-id WindowsFormsControlLibrary2.WPFUserControl is partial
                 inherits type System.Windows.Controls.UserControl
                 attribute ComVisible(false).

       working-storage section.

       
       method-id NEW.
       procedure division.
           invoke self::InitializeComponent()
           goback.
       end method.

       end class.
